package com.example.maketing_app;

import android.os.Bundle;

import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import java.util.ArrayList;
import java.util.List;


public class news_fragment extends Fragment {
    View v;
    private  RecyclerView myrecyclerView1;
    private List<Contact1>  lstcontact1;

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {

        View view= inflater.inflate(R.layout.fragment_news_fragment, container, false);
        myrecyclerView1=(RecyclerView) view.findViewById(R.id.news_recycle);
        RecycleViewAdapter1 recycleViewAdapter1=new RecycleViewAdapter1(getContext(),lstcontact1);
        myrecyclerView1.setLayoutManager(new LinearLayoutManager(getActivity()));
        myrecyclerView1.setAdapter(recycleViewAdapter1);

        return  view;
    }

    @Override
    public void onCreate(@Nullable Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        lstcontact1=new ArrayList<>();

        lstcontact1.add(new Contact1(R.drawable.n1, "၂၀၂၂  ခုနှစ် စထာပါနာ ရုံးချုပ်ဝန်ထမ်းများ သီတင်းကျွတ် ဂါရဝပြုပွဲ","သီတင်းကျွတ်လသည် နှစ်သစ်ကူး သင်္ကြန်ပြီးရင် မြန်မာနိုင်ငံမှာ ဒုတိယအကြီးဆုံး သီတင်းကျွတ်ပွဲတော်ဖြစ်ပါတယ်။ သီတင်းကျွတ်လတွင် မြန်မာလူမျိုးများသည် မိဘ၊ ဆရာ၊ ဆွေမျိုး၊ သက်ကြီးရွယ်အိုများကို ဖူးမြော်ကြသည်။ ဤအစဉ်အလာနှင့် ဗုဒ္ဓဘာသာယဉ်ကျေးမှုကို ရာစုနှစ်ပေါင်းများစွာ ထိန်းသိမ်း ကျင့်သုံးခဲ့သည်။\n" +
                "\n" +
                "မြန်မာနိုင်ငံတစ်ဝှမ်းရှိ သာသပနာဝန်ထမ်းများသည် သက်ကြီးရွယ်အိုများအား ဂါရဝပြုခြင်းဖြင့် ကောင်းမွန်သော ဓလေ့ထုံးတမ်းများကို လိုက်နာကျင့်သုံးကြသည်။\n" +
                "\n" +
                "ယခုနှစ် သီတင်းကျွတ်ပွဲတော်ကာလ။"));
       lstcontact1.add(new Contact1(R.drawable.n2,"ပြောင်းစိုက်ပျိုးခြင်း","သြဂုတ် ၂၂၊၂၀၂၂၊၁၀း၅၃၊အထွေထွေသတင်း\n" +
               "\n" +
               "\n" +
               "ပြောင်းသည် မြန်မာနိုင်ငံတွင် ဆန်ထွက်ရှိပြီးနောက်တွင် အရေးပါဆုံးသီးနှံများထဲမှ တစ်ခုဖြစ်ပြီး ၎င်းသည် လူသားများ၏ စားနပ်ရိက္ခာကွင်းဆက်တွင် အဓိက သီးနှံတစ်ခုဖြစ်သည်။ ထုတ်ပြန်ထားသော အစီရင်ခံစာများအရ မြန်မာနိုင်ငံတွင် စုစုပေါင်းစပါးစိုက်ဧရိယာသည် ဧက ၁ ဒသမ ၂ သန်းခန့်ရှိပြီး တစ်နှစ်လျှင် အထွက်နှုန်းမှာ တန်ချိန် ၂ ဒသမ ၅ မှ ၂ ဒသမ ၉ သန်းအထိရှိကြောင်း သိရသည်။\n" +
               "\n" +
               "ရှမ်းပြည်နယ်တွင် စိုက်ပျိုးထုတ်လုပ်မှု၏ ၅၅ ရာခိုင်နှုန်းကျော်ရှိပြီး စစ်ကိုင်းတိုင်း ဒေသကြီး၊ ကရင်ပြည်နယ်၊ ကချင်ပြည်နယ်၊ ကယားပြည်နယ်နှင့် ဧရာဝတီတိုင်း ဒေသကြီးတို့တွင်လည်း မျိုးစေ့ကြဲသည်။ စိုက်ပျိုးမြေစုစုပေါင်း၏ ၈၅ ရာခိုင်နှုန်းခန့်ကို မိုးရာသီတွင် မေလမှ ဇွန်လအထိ မိုးရာသီတွင် စိုက်ပျိုးပြီး အောက်တိုဘာလမှ နိုဝင်ဘာလအတွင်း ရိတ်သိမ်းသည်။ ကျန် ၁၅ ရာခိုင်နှုန်းကို ခြောက်သွေ့ရာသီသီးနှံအဖြစ် နိုဝင်ဘာလနှင့် ဒီဇင်ဘာလတွင် စိုက်ပျိုးပြီး မတ်လမှ ဧပြီလအတွင်း ရိတ်သိမ်းသည်။\n" +
               "\n" +
               "အထွက်နှုန်း၏ ၄၀ ရာခိုင်နှုန်းခန့်ကို ပြည်တွင်းစားသုံးမှုဖြစ်သည့် ကြက်နှင့် ဝက်ကဏ္ဍများအတွက် မုန့်နှင့် မုန့်ဖုတ်လုပ်ငန်းနှင့် ပြည်တွင်းမှ အရက်ချက်စက်ရုံများမှ အရက်ထုတ်လုပ်ပြီး ကျန် ၆၀ ရာခိုင်နှုန်းကို ထိုင်းနိုင်ငံ၊ ဗီယက်နမ်၊ တရုတ်နှင့် အိန္ဒိယ။ စပါးသီးနှံသည် နိုင်ငံအတွက် နိုင်ငံခြားငွေ အများအပြား ဝင်ရောက်မှုအား ပံ့ပိုးပေးသည့် စိုက်ပျိုးရေးထွက်ကုန်များထဲမှ တစ်ခုဖြစ်သည်။\n" +
               "\n" +
               "SATHAPANA Limited သည် မြန်မာ့လယ်ယာစိုက်ပျိုးရေးကဏ္ဍတွင် မရှိမဖြစ်လိုအပ်သော သီးနှံတစ်မျိုးဖြစ်သည့် စပါးစိုက်ပျိုးမှုကို အမြဲအားပေးနေပါသည်။\n" +
               "\n" +
               "SATHAPANA မှ စုစုပေါင်း ချေးငွေ ပမာဏ ၂၄၃ ဘီလီယံ ထောက်ပံ့ပေးခဲ့သည်။\n" +
               "\n" +
               "တောင်ကြီး၊ အောင်ပန်း၊ ဗုတ်ဆောင်၊ နမ့်ဆန်တွင် ပြောင်းစိုက်တောင်သူ ၃၃၈ ဦး\n" +
               "\n" +
               "မိုးရာသီစိုက်ပျိုးမှုအတွက် ဖယ်ခုံ၊ပြင်လွင်နှင့် ဘားအံမြို့နယ်များ"));
       lstcontact1.add(new Contact1(R.drawable.n3,"မိုးစပါး စိုက်ပျိုးခြင်း","သြဂုတ် ၁၈၊၂၀၂၂၊၈း၄၁၊အထွေထွေသတင်း\n" +
               "\n" +
               "ဆန်သည် စိန်ခေါ်မှုများ မည်သို့ပင်ရှိစေကာမူ မြန်မာနိုင်ငံတွင် နေ့စဉ်စားသုံးနေသော အဓိက သီးနှံဖြစ်သည်။\n" +
               "\n" +
               "သုတေသန အချက်အလက်များအရ ပျမ်းမျှ ကယ်လိုရီနှင့် နေ့စဉ် အာဟာရ လိုအပ်ချက်၏ ၆၀ ရာခိုင်နှုန်းသည် မြို့ပြနှင့် ကျေးလက်ဒေသများတွင် နေထိုင်ကြသော မြန်မာနိုင်ငံသားများ အတွက် ဆန်မှ ရရှိသည်။ စိုက်ပျိုးမြေ၏ ၅၀ ရာခိုင်နှုန်းခန့်သည် စပါးသီးနှံကို စိုက်ပျိုးနေပြီး မြန်မာနိုင်ငံရှိ လယ်ယာထွက်ကုန် စုစုပေါင်း၏ ၄၀ ရာခိုင်နှုန်းခန့်ကို ပံ့ပိုးပေးလျက်ရှိသည်။ ဆန်ထုတ်လုပ်မှုသည် မြန်မာနိုင်ငံ စုစုပေါင်း GDP ၏ 14% ခန့်ကို ပံ့ပိုးပေးသည်။\n" +
               "\n" +
               "SATHAPANA Limited သည် နိုင်ငံတော်၏ စိုက်ပျိုးရေးကဏ္ဍအတွက် အလွန်အရေးပါသော သီးနှံဖြစ်သည့် ဆန်စပါးစိုက်ပျိုးမှုကို အမြဲအားပေးနေပါသည်။ SATHAPANA သည် ယခုနှစ်မုတ်သုံစပါး စိုက်ပျိုးရာသီတွင် မြန်မာနိုင်ငံတစ်ဝှမ်းရှိ ဖောက်သည် ၈,၅၄၇ ဦးအား စိုက်ပျိုးရေးချေးငွေ (စပါးသီးနှံအတွက်သာ) အဖြစ် ကျပ်ငွေ ၈.၈၂၅ ဘီလီယံ ပေးအပ်ခဲ့ပြီး ယခုနှစ် မိုးစပါး စိုက်ပျိုးရာသီတွင် ၂၀၂၂ ခုနှစ် ဧပြီလမှ ဇူလိုင်လအထိ ဖြစ်သည်။"));
       lstcontact1.add(new Contact1(R.drawable.n4,"ဝန်ထမ်းသစ် လုပ်ငန်းခွင် အသုံးချသင်တန်း အပတ်စဉ် (၄၂)","ဇူလိုင်လ 8 ရက် 2022 ခုနှစ် ညနေ 4း00 နာရီ သင်တန်း\n" +
               "\n" +
               "2022 ခုနှစ် ဇူလိုင်လ 05 ရက်နေ့မှ 07 ရက်နေ့အထိ SATHAPANA Limited မှ New Recruitment Training ကို ရန်ကုန်ရုံးချုပ်တွင် ကျင်းပပြုလုပ်ခဲ့ပါသည်။ SPNM သည် ဝန်ထမ်းများ၏ စွမ်းဆောင်ရည်၊ ဝန်ထမ်းများအကြား ကိုယ်ကျင့်တရားများ မြှင့်တင်ရန်နှင့် ၎င်းတို့၏ ထုတ်ကုန်များနှင့် ဝန်ဆောင်မှုဆိုင်ရာ အသိပညာများ ချဲ့ထွင်ရန်အတွက် ဝန်ထမ်းများ၏ စွမ်းဆောင်ရည်၊"));
        lstcontact1.add(new Contact1(R.drawable.n5,"မီးဘေးသင့် ပြည်သူများအားလှူဒါန်းခြင်း","ဇွန်လ ၂၂ ရက် ၂၀၂၁ ၁၂း၅၇ နာရီ လူမှုဝန်ထမ်း\n" +
                "\n" +
                "သဘာဝဘေးအန္တရာယ်ကြောင့် ထိခိုက်ခံစားရသူများအား လူမှုဖူလုံရေးနှင့် အကျိုးကျေးဇူးများ ပေးအပ်ခြင်းသည် သာသပနာ၏ လူမှုဖူလုံရေးအစီအစဉ်၏ ဦးစားပေးနှင့် မူဝါဒများထဲမှ တစ်ခုဖြစ်သည်။ ဖောက်သည်များအား လူမှုကာကွယ်စောင့်ရှောက်ပေးသည့် အဖွဲ့အစည်းဖြစ်ရန် ကတိကဝတ်ပြုထားသည့်အတွက် SATHAPANA Limited သည် မကြာသေးမီက ဖြစ်ပွားခဲ့သော အလုပ်ဖြုတ်ခံရမှုအတွင်း ၎င်းတို့၏ လုပ်ငန်းပေါင်း (၁၇) ခုမှ ဆုံးရှုံးခဲ့ရသော ဖောက်သည် (၁၇) ဦး၏ ချေးငွေကို နုတ်ပယ်ခဲ့ပြီး၊ ဖောက်သည်များ ဝန်ထုပ်ဝန်ပိုးမှ လွတ်မြောက်စေရန်၊ အထူးသဖြင့် သူတို့ဘဝရဲ့ ခက်ခဲတဲ့အချိန်တွေမှာ ပြန်ဆပ်ရတယ်။\n" +
                "\n" +
                "ရွှေဘိုမြို့မဈေးတွင် ၂၀၂၁ ခုနှစ် မေလ ၁ ၅၄ နာရီက မြင်းမူးမြို့နယ် လှည်းဦးကံကျေးရွာ၌ မတ်လ ၁၄၇ ရက် ၂၀၂၁ ခုနှစ် ပစ်ခတ်မှု ဖြစ်ပွားခဲ့ကြောင်း သိရသည်။\n" +
                "\n" +
                "ဧရာဝတီတိုင်းဒေသကြီး ပုသိမ်မြို့နယ် ကန်ကြီးတောင်ဈေး နှင့် ၂၀၂၁ ခုနှစ် ဇွန်လ ၁ ရက်နေ့ နံနက်အစောပိုင်း။"));
     lstcontact1.add(new Contact1(R.drawable.n6,"နွားထိုးကြီး ရုံးခွဲသစ်ဖွင့်လစ်ကြောင်းကြောညာခြင်း","မေလ 27 ရက် 2021 ရက် 2:08 နာရီ အထွေထွေသတင်း\n" +
             "\n" +
             "ငွေရေးကြေးရေးပါဝင်မှုဖြင့် ရပ်ရွာစီးပွားရေးဖွံ့ဖြိုးတိုးတက်မှုကို ပံ့ပိုးကူညီရန် ရည်ရွယ်၍ SATHAPANA သည် ၎င်း၏လုပ်ငန်းကို တိုးချဲ့ဆောင်ရွက်နေပါသည်။\n" +
             "\n" +
             "လုပ်ငန်းလည်ပတ်မှုဧရိယာ။ ယင်းနှင့်ပတ်သက်၍ ကျွန်ုပ်တို့သည် 2021 ခုနှစ် မေလတွင် Natogyi ရုံး ခွဲဖွင့်လှစ်ကြောင်း ကြေညာရခြင်းကို အလွန်ဝမ်းမြောက်မိပါသည်။\n" +
             "\n" +
             "ကျွန်ုပ်တို့၏ဘဏ္ဍာရေးဝန်ဆောင်မှုများကိုရယူရန် အောက်ပါလိပ်စာတွင် ကျွန်ုပ်တို့၏ရုံးများကို ဆက်သွယ်ပါ။\n" +
             "\n" +
             "Natogyi Branch\n" +
             "\n" +
             "Natogyi Branch (5-C/239)၊မြင်းခြံ-ယွမ်လမ်း၊အမှတ်(၅)ရပ်ကွက်၊နတ်ကြီးမြို့နယ်၊မန္တလေးတိုင်းဒေသကြီး၊"));
       lstcontact1.add(new Contact1(R.drawable.n7,"မအသိအမှတ်ပြုလက်မှတ်များအား ချီးမြှင့်ပေးအပ်ခြင်း","၂၄ ဧပြီ ၂၀၂၁ ၊ရန်ကုန်။\n" +
               "\n" +
               "ကြိုးစားအားထုတ်မှု၊ ကြိုးပမ်းမှုနှင့် ကတိကဝတ်များ အောင်မြင်သူများကို ကျေးဇူးတင် ဂုဏ်ပြုသည့် အခမ်းအနား၊\n" +
               "\n" +
               "Oracle FLEXTCUBE Core Banking System ကို ယနေ့ နံနက် ၁၁း၀၀ နာရီတွင် SATHAPANA Limited ရုံးချုပ်၌ ကျင်းပခဲ့ပါသည်။\n" +
               "\n" +
               "အဆိုပါ အခမ်းအနားသို့ အမှုဆောင်အရာရှိချုပ် (CEO)၊ အမှုဆောင် ကော်မတီဝင်များ၊ စီမံခန့်ခွဲရေးအဖွဲ့များ တက်ရောက်ကြပြီး၊\n" +
               "\n" +
               "ပရောဂျက်တွင် ပါဝင်ခဲ့ကြသော ဝန်ထမ်းများ။\n" +
               "\n" +
               "ဤပရောဂျက်ကို အောင်မြင်စွာ အကောင်အထည်ဖော်ခြင်းသည် ကျွန်ုပ်တို့၏ တန်ဖိုးရှိသော ငွေကြေးဝန်ဆောင်မှုများကို ပေးဆောင်ရန် ကျွန်ုပ်တို့၏ ကတိကဝတ်ကို အားဖြည့်ပေးသည့် သက်သေပြချက်ဖြစ်ပြီး ဝန်ထမ်းများအား အသိအမှတ်ပြု ကျေးဇူးတင်စကား ပြောကြားလိုကြောင်း အမှုဆောင်အရာရှိချုပ် Mr Seang Serey (CEO) က ပြောကြားခဲ့ပါသည်။ ဤ core banking pe အတွက် အလှူငွေထည့်ဝင်မှုနှင့် အပ်နှံထားခဲ့သော ဌာနအသီးသီးမှ၊\n" +
               "\n" +
               "စီမံကိန်းဖြစ်ရန်\n" +
               "\n" +
               "Covid-19 ကပ်ရောဂါကြားတွင်ပင် ပြီးမြောက်အောင်မြင်ခဲ့ပါသည်။\n" +
               "\n" +
               "\n" +
               "\n" +
               "FLEXCUBE ၏ လိုက်လျောညီထွေရှိမှုနှင့် ချဲ့ထွင်နိုင်မှုနှင့်အတူ၊ SATHAPANA Limited သည် အရှိန်မြှင့်စဉ်တွင် ၎င်း၏ လုပ်ငန်းဆောင်ရွက်မှု စွမ်းဆောင်ရည်ကို မြှင့်တင်နိုင်မည်ဖြစ်သည်။\n" +
               "\n" +
               "၎င်း၏ ထုတ်ကုန်များနှင့် ဝန်ဆောင်မှုများကို ၎င်း၏ ချေးငွေနှင့် အပ်နှံသည့် ဖောက်သည်များထံ ဖြန့်ချိသည်။ ပလက်ဖောင်းသည် အဖွဲ့အစည်းအား အချိန်နှင့်တပြေးညီ လုပ်ဆောင်နိုင်စေရန် စွမ်းအားပေးမည်ဖြစ်သည်။"));
      lstcontact1.add(new Contact1(R.drawable.n8,"နမ့်စန်ရုံးခွဲသစ်ဖွင့်လစ်ကြောင်း ကြောညာခြင်း","ဇန်နဝါရီလ 15. 2021 ၊10:03 am အထွေထွေသတင်း\n" +
              "\n" +
              "    ငွေကြေးပါဝင်မှုမှတစ်ဆင့် ရပ်ရွာ၏စီးပွားရေးဖွံ့ဖြိုးတိုးတက်မှုကို ပံ့ပိုးကူညီရန် ရည်ရွယ်၍ SATHAPANA သည် ၎င်း၏လုပ်ငန်းလည်ပတ်မှုဧရိယာကို တိုးချဲ့ဆောင်ရွက်လျက်ရှိသည်။ ယင်းနှင့်ပတ်သက်၍ နန်ဆမ်ဘဏ်ခွဲကို 2020 ခုနှစ် ဒီဇင်ဘာလနှင့် 2021 ခုနှစ် ဇန်နဝါရီလအတွင်း ဖွင့်လှစ်မည်ကို ကျွန်ုပ်တို့ အလွန်ဝမ်းမြောက်မိပါသည်။\n" +
              "\n" +
              "    ကျွန်ုပ်တို့၏ဘဏ္ဍာရေးဝန်ဆောင်မှုများကိုရယူရန် အောက်ပါလိပ်စာတွင် ကျွန်ုပ်တို့၏ရုံးများကို ဆက်သွယ်ပါ။\n" +
              "\n" +
              "    Nanhsam ရုံးခွဲ\n" +
              "\n" +
              "    အမှတ် ၁/၇၄၇၊ဘုရင့်နောင်လမ်း၊အမှတ်(၁)ရပ်ကွက်၊နန်းဆောင်မြို့နယ်၊ရှမ်းပြည်(တောင်ပိုင်း)"));
      lstcontact1.add(new Contact1(R.drawable.n9,"အလုပ်သင်အစီအစဉ် အပတ်စဉ် (၁)","နိုဝင်ဘာလ 12,2021 9:48 am ၊လေ့ကျင့်ရေး\n" +
              "\n" +
              "Sathapana Limited သည် လူငယ်များ၏ စိတ်အားထက်သန်မှုနှင့် အရည်အသွေးအတွက် အမြဲခြေရာခံဖြစ်သောကြောင့် စီမံခန့်ခွဲမှုသင်တန်းသားနှစ်ဦးကို အောင်မြင်စွာ ပြုစုပျိုးထောင်ပေးခဲ့သည်။\n" +
              "\n" +
              "Management Trainee Program (Paid Opportunity) မှတဆင့် ပထမဆုံးအကြိမ်၊\n" +
              "\n" +
              "သင်တန်းသားများအား Sathapana (Credit, Operations, Marketing, HR, IT and MIS, Administration, Finance, Risk and Compliance, Intemal Audit) စသည့် ဌာနများအားလုံးတွင် တာဝန်ပေးအပ်ထားပါသည်။ သူတို့သည် အလုပ်လုပ်ပြီး သင်ယူခဲ့ပြီး အဖိုးတန်သော အတွေ့အကြုံနှင့် ဗဟုသုတများစွာကို ရရှိခဲ့သည်။\n" +
              "\n" +
              "Sathapana Limited Management Trainee Program သည် ဘွဲ့ရပြီးသူများအတွက် ရွှေအခွင့်အလမ်းတစ်ခုဖြစ်ပြီး Sathapana မှ ရိုးသားစွာ ကြိုဆိုလျက်"));
    }




}